; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-5-12)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	s13 - location
	p0-2 - location
	p1-0 - location
	p1-6 - location
	p2-3 - location
	p2-9 - location
	p2-10 - location
	p3-4 - location
	p3-6 - location
	p4-9 - location
	p4-10 - location
	p4-11 - location
	p4-13 - location
	p5-0 - location
	p5-4 - location
	p7-6 - location
	p8-3 - location
	p9-0 - location
	p11-5 - location
	p11-7 - location
	p11-9 - location
	p11-10 - location
	p13-1 - location
	p13-8 - location
	p13-10 - location
	p13-12 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s3)
	(at driver3 s9)
	(at driver4 s13)
	(at driver5 s9)
	(at truck1 s1)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s12)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s6)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s4)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s3)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at package1 s0)
	(at package2 s3)
	(at package3 s9)
	(at package4 s8)
	(at package5 s11)
	(at package6 s7)
	(at package7 s6)
	(at package8 s10)
	(at package9 s10)
	(at package10 s11)
	(at package11 s0)
	(at package12 s0)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-9)
	(path p2-9 s2)
	(path s9 p2-9)
	(path p2-9 s9)
	(path s2 p2-10)
	(path p2-10 s2)
	(path s10 p2-10)
	(path p2-10 s10)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(path s4 p4-9)
	(path p4-9 s4)
	(path s9 p4-9)
	(path p4-9 s9)
	(path s4 p4-10)
	(path p4-10 s4)
	(path s10 p4-10)
	(path p4-10 s10)
	(path s4 p4-11)
	(path p4-11 s4)
	(path s11 p4-11)
	(path p4-11 s11)
	(path s4 p4-13)
	(path p4-13 s4)
	(path s13 p4-13)
	(path p4-13 s13)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(path s7 p7-6)
	(path p7-6 s7)
	(path s6 p7-6)
	(path p7-6 s6)
	(path s8 p8-3)
	(path p8-3 s8)
	(path s3 p8-3)
	(path p8-3 s3)
	(path s9 p9-0)
	(path p9-0 s9)
	(path s0 p9-0)
	(path p9-0 s0)
	(path s11 p11-5)
	(path p11-5 s11)
	(path s5 p11-5)
	(path p11-5 s5)
	(path s11 p11-7)
	(path p11-7 s11)
	(path s7 p11-7)
	(path p11-7 s7)
	(path s11 p11-9)
	(path p11-9 s11)
	(path s9 p11-9)
	(path p11-9 s9)
	(path s11 p11-10)
	(path p11-10 s11)
	(path s10 p11-10)
	(path p11-10 s10)
	(path s13 p13-1)
	(path p13-1 s13)
	(path s1 p13-1)
	(path p13-1 s1)
	(path s13 p13-8)
	(path p13-8 s13)
	(path s8 p13-8)
	(path p13-8 s8)
	(path s13 p13-10)
	(path p13-10 s13)
	(path s10 p13-10)
	(path p13-10 s10)
	(path s13 p13-12)
	(path p13-12 s13)
	(path s12 p13-12)
	(path p13-12 s12)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 27)
	(= (time-to-drive s1 s0) 27)
	(link s0 s4)
	(link s4 s0)
	(= (time-to-drive s0 s4) 87)
	(= (time-to-drive s4 s0) 87)
	(link s0 s12)
	(link s12 s0)
	(= (time-to-drive s0 s12) 6)
	(= (time-to-drive s12 s0) 6)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 26)
	(= (time-to-drive s2 s1) 26)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 15)
	(= (time-to-drive s7 s1) 15)
	(link s1 s9)
	(link s9 s1)
	(= (time-to-drive s1 s9) 77)
	(= (time-to-drive s9 s1) 77)
	(link s1 s13)
	(link s13 s1)
	(= (time-to-drive s1 s13) 25)
	(= (time-to-drive s13 s1) 25)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 71)
	(= (time-to-drive s0 s2) 71)
	(link s2 s10)
	(link s10 s2)
	(= (time-to-drive s2 s10) 46)
	(= (time-to-drive s10 s2) 46)
	(link s2 s11)
	(link s11 s2)
	(= (time-to-drive s2 s11) 25)
	(= (time-to-drive s11 s2) 25)
	(link s3 s8)
	(link s8 s3)
	(= (time-to-drive s3 s8) 85)
	(= (time-to-drive s8 s3) 85)
	(link s3 s10)
	(link s10 s3)
	(= (time-to-drive s3 s10) 94)
	(= (time-to-drive s10 s3) 94)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 41)
	(= (time-to-drive s6 s4) 41)
	(link s4 s8)
	(link s8 s4)
	(= (time-to-drive s4 s8) 21)
	(= (time-to-drive s8 s4) 21)
	(link s4 s11)
	(link s11 s4)
	(= (time-to-drive s4 s11) 71)
	(= (time-to-drive s11 s4) 71)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 6)
	(= (time-to-drive s5 s6) 6)
	(link s6 s8)
	(link s8 s6)
	(= (time-to-drive s6 s8) 43)
	(= (time-to-drive s8 s6) 43)
	(link s6 s10)
	(link s10 s6)
	(= (time-to-drive s6 s10) 22)
	(= (time-to-drive s10 s6) 22)
	(link s6 s11)
	(link s11 s6)
	(= (time-to-drive s6 s11) 95)
	(= (time-to-drive s11 s6) 95)
	(link s8 s0)
	(link s0 s8)
	(= (time-to-drive s8 s0) 31)
	(= (time-to-drive s0 s8) 31)
	(link s8 s12)
	(link s12 s8)
	(= (time-to-drive s8 s12) 59)
	(= (time-to-drive s12 s8) 59)
	(link s9 s0)
	(link s0 s9)
	(= (time-to-drive s9 s0) 4)
	(= (time-to-drive s0 s9) 4)
	(link s9 s3)
	(link s3 s9)
	(= (time-to-drive s9 s3) 39)
	(= (time-to-drive s3 s9) 39)
	(link s9 s7)
	(link s7 s9)
	(= (time-to-drive s9 s7) 12)
	(= (time-to-drive s7 s9) 12)
	(link s9 s8)
	(link s8 s9)
	(= (time-to-drive s9 s8) 91)
	(= (time-to-drive s8 s9) 91)
	(link s9 s11)
	(link s11 s9)
	(= (time-to-drive s9 s11) 11)
	(= (time-to-drive s11 s9) 11)
	(link s10 s0)
	(link s0 s10)
	(= (time-to-drive s10 s0) 98)
	(= (time-to-drive s0 s10) 98)
	(link s10 s1)
	(link s1 s10)
	(= (time-to-drive s10 s1) 58)
	(= (time-to-drive s1 s10) 58)
	(link s10 s8)
	(link s8 s10)
	(= (time-to-drive s10 s8) 22)
	(= (time-to-drive s8 s10) 22)
	(link s10 s9)
	(link s9 s10)
	(= (time-to-drive s10 s9) 83)
	(= (time-to-drive s9 s10) 83)
	(link s11 s7)
	(link s7 s11)
	(= (time-to-drive s11 s7) 34)
	(= (time-to-drive s7 s11) 34)
	(link s12 s4)
	(link s4 s12)
	(= (time-to-drive s12 s4) 49)
	(= (time-to-drive s4 s12) 49)
	(link s12 s5)
	(link s5 s12)
	(= (time-to-drive s12 s5) 69)
	(= (time-to-drive s5 s12) 69)
	(link s12 s6)
	(link s6 s12)
	(= (time-to-drive s12 s6) 40)
	(= (time-to-drive s6 s12) 40)
	(link s12 s9)
	(link s9 s12)
	(= (time-to-drive s12 s9) 75)
	(= (time-to-drive s9 s12) 75)
	(link s13 s5)
	(link s5 s13)
	(= (time-to-drive s13 s5) 83)
	(= (time-to-drive s5 s13) 83)
	(link s13 s7)
	(link s7 s13)
	(= (time-to-drive s13 s7) 16)
	(= (time-to-drive s7 s13) 16)
	(link s13 s9)
	(link s9 s13)
	(= (time-to-drive s13 s9) 99)
	(= (time-to-drive s9 s13) 99)
	(link s13 s11)
	(link s11 s13)
	(= (time-to-drive s13 s11) 54)
	(= (time-to-drive s11 s13) 54)
	(link s13 s12)
	(link s12 s13)
	(= (time-to-drive s13 s12) 62)
	(= (time-to-drive s12 s13) 62)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s2)
	(at driver3 s2)
	(at driver5 s3)
	(at truck1 s8)
	(at truck2 s6)
	(at package1 s7)
	(at package2 s11)
	(at package3 s7)
	(at package4 s6)
	(at package5 s1)
	(at package6 s3)
	(at package8 s9)
	(at package9 s0)
	(at package10 s3)
	(at package11 s3)
	(at package12 s7)
	))

(:metric minimize (+ (* 1 (total-time)) (* 2 (fuel-used))))

)

; plan
1. (walk driver2 s3 p2-3)
   deleted: (at driver2 s3)
   added: (at driver2 p2-3)
   goals met: 0 of 16
2. (walk driver2 p2-3 s2)
   deleted: (at driver2 p2-3)
   added: (at driver2 s2)
   goals met: 1 of 16
3. (walk driver3 s9 p2-9)
   deleted: (at driver3 s9)
   added: (at driver3 p2-9)
   goals met: 1 of 16
4. (walk driver3 p2-9 s2)
   deleted: (at driver3 p2-9)
   added: (at driver3 s2)
   goals met: 2 of 16
5. (walk driver4 s13 p13-1)
   deleted: (at driver4 s13)
   added: (at driver4 p13-1)
   goals met: 2 of 16
6. (board-truck driver1 truck4 s4)
   deleted: (at driver1 s4) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 2 of 16
7. (drive-truck truck4 s4 s0 driver1)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   changed: (fuel-used) from 0 to 870
   goals met: 2 of 16
8. (load-truck package1 truck4 s0)
   deleted: (at package1 s0)
   added: (in package1 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 2 of 16
9. (load-truck package11 truck4 s0)
   deleted: (at package11 s0)
   added: (in package11 truck4)
   changed: (load truck4) from 1 to 2, (fuel-per-minute truck4) from 11 to 13
   goals met: 2 of 16
10. (load-truck package12 truck4 s0)
   deleted: (at package12 s0)
   added: (in package12 truck4)
   changed: (load truck4) from 2 to 3, (fuel-per-minute truck4) from 13 to 16
   goals met: 2 of 16
11. (drive-truck truck4 s0 s12 driver1)
   deleted: (at truck4 s0)
   added: (at truck4 s12)
   changed: (fuel-used) from 870 to 966
   goals met: 2 of 16
12. (walk driver4 p13-1 s1)
   deleted: (at driver4 p13-1)
   added: (at driver4 s1)
   goals met: 2 of 16
13. (drive-truck truck4 s12 s9 driver1)
   deleted: (at truck4 s12)
   added: (at truck4 s9)
   changed: (fuel-used) from 966 to 2166
   goals met: 2 of 16
14. (load-truck package3 truck4 s9)
   deleted: (at package3 s9)
   added: (in package3 truck4)
   changed: (load truck4) from 3 to 4, (fuel-per-minute truck4) from 16 to 20
   goals met: 2 of 16
15. (disembark-truck driver1 truck4 s9)
   deleted: (driving driver1 truck4)
   added: (at driver1 s9) (empty truck4)
   goals met: 2 of 16
16. (board-truck driver5 truck4 s9)
   deleted: (at driver5 s9) (empty truck4)
   added: (driving driver5 truck4)
   goals met: 2 of 16
17. (board-truck driver4 truck1 s1)
   deleted: (at driver4 s1) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 2 of 16
18. (drive-truck truck1 s1 s10 driver4)
   deleted: (at truck1 s1)
   added: (at truck1 s10)
   changed: (fuel-used) from 2166 to 2746
   goals met: 2 of 16
19. (load-truck package8 truck1 s10)
   deleted: (at package8 s10)
   added: (in package8 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 2 of 16
20. (load-truck package9 truck1 s10)
   deleted: (at package9 s10)
   added: (in package9 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 2 of 16
21. (drive-truck truck1 s10 s8 driver4)
   deleted: (at truck1 s10)
   added: (at truck1 s8)
   changed: (fuel-used) from 2746 to 3032
   goals met: 3 of 16
22. (load-truck package4 truck1 s8)
   deleted: (at package4 s8)
   added: (in package4 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 3 of 16
23. (drive-truck truck1 s8 s6 driver4)
   deleted: (at truck1 s8)
   added: (at truck1 s6)
   changed: (fuel-used) from 3032 to 3720
   goals met: 2 of 16
24. (unload-truck package4 truck1 s6)
   deleted: (in package4 truck1)
   added: (at package4 s6)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 3 of 16
25. (drive-truck truck1 s6 s8 driver4)
   deleted: (at truck1 s6)
   added: (at truck1 s8)
   changed: (fuel-used) from 3720 to 4279
   goals met: 4 of 16
26. (drive-truck truck1 s8 s0 driver4)
   deleted: (at truck1 s8)
   added: (at truck1 s0)
   changed: (fuel-used) from 4279 to 4682
   goals met: 3 of 16
27. (unload-truck package9 truck1 s0)
   deleted: (in package9 truck1)
   added: (at package9 s0)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 4 of 16
28. (drive-truck truck1 s0 s9 driver4)
   deleted: (at truck1 s0)
   added: (at truck1 s9)
   changed: (fuel-used) from 4682 to 4726
   goals met: 4 of 16
29. (unload-truck package8 truck1 s9)
   deleted: (in package8 truck1)
   added: (at package8 s9)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 5 of 16
30. (drive-truck truck4 s9 s3 driver5)
   deleted: (at truck4 s9)
   added: (at truck4 s3)
   changed: (fuel-used) from 4726 to 5506
   goals met: 5 of 16
31. (unload-truck package11 truck4 s3)
   deleted: (in package11 truck4)
   added: (at package11 s3)
   changed: (load truck4) from 4 to 3, (fuel-per-minute truck4) from 20 to 16
   goals met: 6 of 16
32. (drive-truck truck4 s3 s9 driver5)
   deleted: (at truck4 s3)
   added: (at truck4 s9)
   changed: (fuel-used) from 5506 to 6130
   goals met: 6 of 16
33. (drive-truck truck1 s9 s8 driver4)
   deleted: (at truck1 s9)
   added: (at truck1 s8)
   changed: (fuel-used) from 6130 to 7040
   goals met: 7 of 16
34. (drive-truck truck1 s8 s12 driver4)
   deleted: (at truck1 s8)
   added: (at truck1 s12)
   changed: (fuel-used) from 7040 to 7630
   goals met: 6 of 16
35. (drive-truck truck4 s9 s7 driver5)
   deleted: (at truck4 s9)
   added: (at truck4 s7)
   changed: (fuel-used) from 7630 to 7822
   goals met: 6 of 16
36. (unload-truck package1 truck4 s7)
   deleted: (in package1 truck4)
   added: (at package1 s7)
   changed: (load truck4) from 3 to 2, (fuel-per-minute truck4) from 16 to 13
   goals met: 7 of 16
37. (unload-truck package3 truck4 s7)
   deleted: (in package3 truck4)
   added: (at package3 s7)
   changed: (load truck4) from 2 to 1, (fuel-per-minute truck4) from 13 to 11
   goals met: 8 of 16
38. (unload-truck package12 truck4 s7)
   deleted: (in package12 truck4)
   added: (at package12 s7)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 9 of 16
39. (load-truck package6 truck4 s7)
   deleted: (at package6 s7)
   added: (in package6 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 9 of 16
40. (drive-truck truck4 s7 s9 driver5)
   deleted: (at truck4 s7)
   added: (at truck4 s9)
   changed: (fuel-used) from 7822 to 7954
   goals met: 9 of 16
41. (disembark-truck driver4 truck1 s12)
   deleted: (driving driver4 truck1)
   added: (at driver4 s12) (empty truck1)
   goals met: 9 of 16
42. (drive-truck truck4 s9 s3 driver5)
   deleted: (at truck4 s9)
   added: (at truck4 s3)
   changed: (fuel-used) from 7954 to 8383
   goals met: 9 of 16
43. (unload-truck package6 truck4 s3)
   deleted: (in package6 truck4)
   added: (at package6 s3)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 10 of 16
44. (load-truck package2 truck4 s3)
   deleted: (at package2 s3)
   added: (in package2 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 10 of 16
45. (drive-truck truck4 s3 s9 driver5)
   deleted: (at truck4 s3)
   added: (at truck4 s9)
   changed: (fuel-used) from 8383 to 8812
   goals met: 10 of 16
46. (drive-truck truck4 s9 s11 driver5)
   deleted: (at truck4 s9)
   added: (at truck4 s11)
   changed: (fuel-used) from 8812 to 8933
   goals met: 10 of 16
47. (unload-truck package2 truck4 s11)
   deleted: (in package2 truck4)
   added: (at package2 s11)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 11 of 16
48. (load-truck package5 truck4 s11)
   deleted: (at package5 s11)
   added: (in package5 truck4)
   changed: (load truck4) from 0 to 1, (fuel-per-minute truck4) from 10 to 11
   goals met: 11 of 16
49. (load-truck package10 truck4 s11)
   deleted: (at package10 s11)
   added: (in package10 truck4)
   changed: (load truck4) from 1 to 2, (fuel-per-minute truck4) from 11 to 13
   goals met: 11 of 16
50. (drive-truck truck4 s11 s9 driver5)
   deleted: (at truck4 s11)
   added: (at truck4 s9)
   changed: (fuel-used) from 8933 to 9076
   goals met: 11 of 16
51. (drive-truck truck4 s9 s3 driver5)
   deleted: (at truck4 s9)
   added: (at truck4 s3)
   changed: (fuel-used) from 9076 to 9583
   goals met: 11 of 16
52. (unload-truck package10 truck4 s3)
   deleted: (in package10 truck4)
   added: (at package10 s3)
   changed: (load truck4) from 2 to 1, (fuel-per-minute truck4) from 13 to 11
   goals met: 12 of 16
53. (disembark-truck driver5 truck4 s3)
   deleted: (driving driver5 truck4)
   added: (at driver5 s3) (empty truck4)
   goals met: 13 of 16
54. (board-truck driver4 truck1 s12)
   deleted: (at driver4 s12) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 13 of 16
55. (unload-truck package5 truck4 s3)
   deleted: (in package5 truck4)
   added: (at package5 s3)
   changed: (load truck4) from 1 to 0, (fuel-per-minute truck4) from 11 to 10
   goals met: 13 of 16
56. (disembark-truck driver4 truck1 s12)
   deleted: (driving driver4 truck1)
   added: (at driver4 s12) (empty truck1)
   goals met: 13 of 16
57. (board-truck driver5 truck4 s3)
   deleted: (at driver5 s3) (empty truck4)
   added: (driving driver5 truck4)
   goals met: 12 of 16
58. (board-truck driver4 truck1 s12)
   deleted: (at driver4 s12) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 12 of 16
59. (drive-truck truck4 s3 s9 driver5)
   deleted: (at truck4 s3)
   added: (at truck4 s9)
   changed: (fuel-used) from 9583 to 9973
   goals met: 12 of 16
60. (drive-truck truck1 s12 s8 driver4)
   deleted: (at truck1 s12)
   added: (at truck1 s8)
   changed: (fuel-used) from 9973 to 10563
   goals met: 13 of 16
61. (drive-truck truck4 s9 s12 driver5)
   deleted: (at truck4 s9)
   added: (at truck4 s12)
   changed: (fuel-used) from 10563 to 11313
   goals met: 13 of 16
62. (drive-truck truck1 s8 s3 driver4)
   deleted: (at truck1 s8)
   added: (at truck1 s3)
   changed: (fuel-used) from 11313 to 12163
   goals met: 12 of 16
63. (load-truck package5 truck1 s3)
   deleted: (at package5 s3)
   added: (in package5 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 12 of 16
64. (disembark-truck driver5 truck4 s12)
   deleted: (driving driver5 truck4)
   added: (at driver5 s12) (empty truck4)
   goals met: 12 of 16
65. (board-truck driver5 truck2 s12)
   deleted: (at driver5 s12) (empty truck2)
   added: (driving driver5 truck2)
   goals met: 12 of 16
66. (drive-truck truck2 s12 s6 driver5)
   deleted: (at truck2 s12)
   added: (at truck2 s6)
   changed: (fuel-used) from 12163 to 12563
   goals met: 13 of 16
67. (drive-truck truck1 s3 s8 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s8)
   changed: (fuel-used) from 12563 to 13498
   goals met: 14 of 16
68. (disembark-truck driver5 truck2 s6)
   deleted: (driving driver5 truck2)
   added: (at driver5 s6) (empty truck2)
   goals met: 14 of 16
69. (walk driver5 s6 p3-6)
   deleted: (at driver5 s6)
   added: (at driver5 p3-6)
   goals met: 14 of 16
70. (walk driver5 p3-6 s3)
   deleted: (at driver5 p3-6)
   added: (at driver5 s3)
   goals met: 15 of 16
71. (drive-truck truck1 s8 s9 driver4)
   deleted: (at truck1 s8)
   added: (at truck1 s9)
   changed: (fuel-used) from 13498 to 14499
   goals met: 14 of 16
72. (drive-truck truck1 s9 s1 driver4)
   deleted: (at truck1 s9)
   added: (at truck1 s1)
   changed: (fuel-used) from 14499 to 15346
   goals met: 14 of 16
73. (unload-truck package5 truck1 s1)
   deleted: (in package5 truck1)
   added: (at package5 s1)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 15 of 16
74. (drive-truck truck1 s1 s10 driver4)
   deleted: (at truck1 s1)
   added: (at truck1 s10)
   changed: (fuel-used) from 15346 to 15926
   goals met: 15 of 16
75. (drive-truck truck1 s10 s8 driver4)
   deleted: (at truck1 s10)
   added: (at truck1 s8)
   changed: (fuel-used) from 15926 to 16146
   goals met: 16 of 16
